# Ch-10. apply 메서드 활용
## 10-1. 간단한 함수 만들기

In [1]:
def my_sq(x):
    return x ** 2

In [2]:
def my_exp(x, n):
    return x ** n

In [3]:
my_sq(4)

16

In [6]:
my_exp(2, 3)

8

## 10-2. apply 활용 - 기초

### - (p.206) 시리즈와 데이터프레임

In [7]:
import pandas as pd

#### * 열 단위로 데이터프레임 생성

In [31]:
df = pd.DataFrame({'a' : [10, 20, 30],
                   'b' : [20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

#### * 행 단위로 데이터프레임 생성

In [102]:
df2 = pd.DataFrame([[10, 20], [20, 30], [30, 40]], index = ['a', 'b', 'c'], columns = ['A', 'B'])
df2

    A   B
a  10  20
b  20  30
c  30  40

#### (1) 시리즈.apply()

In [15]:
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [17]:
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [20]:
ex = df['a'].apply(my_exp, n=2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [21]:
df['a'].apply(my_exp, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

#### (2) 데이터프레임.apply()

In [22]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [23]:
def print_me(x):
    print(x)

##### * 1개의 인자 - 열 방향 적용

In [26]:
df.apply(print_me, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

##### * 1개의 인자 - 행 방향 적용

In [27]:
df.apply(print_me, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

##### * 3개의 인자 - 열 방향 적용

In [28]:
def avg_3(x, y, z):
    return (x + y + z) / 3

In [ ]:
# Error
df.apply(avg_3)

In [34]:
# 열 단위로 데이터 처리할 수 있도록 함수 수정
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

In [35]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

In [36]:
mean_col1, mean_col2 = df.apply(avg_3_apply)

In [37]:
mean_col1

20.0

In [38]:
mean_col2

30.0

##### * 2개의 인자 - 행 방향 적용

In [49]:
def avg_2_apply(row):
    x = row[0]
    y = row[1]
    return (x + y) / 2

In [52]:
df.apply(avg_2_apply, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

##### * n개의 인자 - 열 방향 적용

In [47]:
def avg_n_apply(col):
    sum = 0
    for item in col:
        sum += item
    return sum / df.shape[0]

In [48]:
df.apply(avg_n_apply)

a    20.0
b    30.0
dtype: float64

##### * n개의 인자 - 행 방향 적용

In [45]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [46]:
df.apply(avg_2_apply, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

## 10-3. apply 활용 - 고급

In [66]:
import seaborn as sns

In [57]:
titanic_raw = sns.load_dataset('titanic')
titanic = titanic_raw.copy()

In [58]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [59]:
titanic.shape

(891, 15)

In [61]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [60]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [63]:
titanic.describe(include = 'all')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### - (p.212) 누락값 갯수 반환 - 열 방향

In [65]:
import numpy as np

In [67]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [87]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [74]:
# 함수 및 apply 없이도 누락값 갯수 반환하는 방법
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

#### * 누락값 비율 계산

In [75]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [84]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

#### * 누락값이 아닌 값의 비율 계산

In [85]:
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [86]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

### - (p.214) 누락값 처리 - 행 방향

In [88]:
titanic.apply(count_missing, axis = 1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [89]:
titanic.apply(prop_missing, axis = 1)

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [90]:
titanic.apply(prop_complete, axis = 1)

0      0.933333
1      1.000000
2      0.933333
3      1.000000
4      0.933333
         ...
886    0.933333
887    1.000000
888    0.866667
889    1.000000
890    0.933333
Length: 891, dtype: float64

### - (p.215) 누락값이 있는 데이터 추출

In [93]:
titanic['num_missing'] = titanic.apply(count_missing, axis = 1)

In [96]:
titanic[['survived', 'sex', 'age', 'num_missing']].head()

   survived     sex   age  num_missing
0         0    male  22.0            1
1         1  female  38.0            0
2         1  female  26.0            1
3         1  female  35.0            0
4         0    male  35.0            1

In [100]:
# 누락값이 2개 이상인 데이터 추출
titanic.loc[titanic['num_missing'] > 1, :].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
186,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,2
648,0,3,male,NaN,0,0,7.5500,S,Third,man,True,NaN,Southampton,no,True,2
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
241,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,2
260,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
201,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False,2
295,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True,2
270,0,1,male,NaN,0,0,31.0000,S,First,man,True,NaN,Southampton,no,True,2
168,0,1,male,NaN,0,0,25.9250,S,First,man,True,NaN,Southampton,no,True,2
126,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

## - End.